# Bases de Datos
## Clase Pr谩ctica 4: DDL, DML y DQL

### Configuraci贸n 锔

In [ ]:
import sqlalchemy

Vamos a estar usando el m贸dulo de Python `sqlalchemy`, el cual nos permitir谩 ejecutar c贸digo SQL dentro de una celda de Python, gracias a la funci贸n `create_engine`. Esta recibe un par谩metro: el _string_ de conexi贸n del servicio de MySQL.

In [ ]:
sqlalchemy.create_engine("mysql://root:root@localhost:3306")

<details>
  <summary>Haz click aqu铆 para ver la explicaci贸n del <i>string</i> de conexi贸n</summary>
  
En el _string_ de conexi贸n hay 3 fragmentos relevantes:

$mysql://\underbrace{root}_{usuario}:\underbrace{root}_{contrase帽a}@localhost:\underbrace{3306}_{puerto}$

Si茅ntete libre de modificar acordemente el _string_ de conexi贸n en los pocos lugares en los que aparece en este archivo :)

</details>

Necesitamos dos pasos m谩s de configuraci贸n:
1. cargar la extensi贸n de SQL:

In [ ]:
%load_ext sql

2. conectarnos al servidor, usando el mismo _string_ de conexi贸n:

In [ ]:
%sql mysql://root:root@localhost:3306

Y... 隆ya estamos listos para ejecutar SQL! コココ

隆隆隆Vamos a hacer ejercicios!!!

### Ejercicios 锔锔
#### _Data Definition Language & Data Manipulation Language_
Dadas las relaciones que se muestran a continuaci贸n del dise帽o de una base de datos, solucione los incisos que le siguen:

**Cliente**(<u>NoC</u>, NombreC, Provincia)  
**Producto**(<u>NoP</u>, NombreP, Precio)  
**Orden**(<u>NoC</u>, <u>NoP</u>, <u>Fecha</u>, Precio, Cantidad)  
NoC **FK** Cliente. No admite nulos  
NoP **FK** Producto. No admite nulos  

a) Escriba las sentencias SQL para la creaci贸n de la base de datos `venta` que corresponda con las relaciones anteriores.

> **Voz en off con tono grave:** para ejecutar SQL debemos comenzar el _statement_ con `%sql` en caso de que s贸lo ocupe una l铆nea, y con `%%sql` si se trata de un bloque. 
> 
> Veamos c贸mo crear la base de datos:

In [ ]:
%%sql
DROP DATABASE IF EXISTS ventas;
CREATE DATABASE IF NOT EXISTS ventas;

In [ ]:
%sql SHOW DATABASES;

In [ ]:
# y si se crea, se...
%sql

隆A CREAR TABLAS!

In [ ]:
%%sql CREATE TABLE Cliente(
    NoC INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreC NCHAR(50) NOT NULL UNIQUE,
    Provincia NCHAR(25) NOT NULL
);

In [ ]:
%%sql CREATE TABLE Producto(
    NoP INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreP NCHAR(50) NOT NULL UNIQUE,
    Precio DOUBLE UNSIGNED NOT NULL
);

In [ ]:
%%sql CREATE TABLE Orden(
    NoC INT REFERENCES Cliente(NoC)
        ON DELETE SET NULL
        ON UPDATE CASCADE,
    NoP INT REFERENCES Producto(NoP)
        ON DELETE SET NULL
        ON UPDATE CASCADE,
    Fecha DATETIME,
    Precio DOUBLE UNSIGNED,
    Cantidad INT NOT NULL,
    PRIMARY KEY (
        NoC ASC,
        NoP ASC,
        Fecha ASC
    ),
    CHECK (Cantidad > 0)
);

b) Utilizando el lenguaje SQL realice las siguientes modificaciones a la definici贸n de

1. Agregar el atributo Categor铆a, de tipo VARCHAR y no m谩s de 60 caracteres, a la tabla Producto.

2. Agregar el atributo Direcci贸n, de tipo CHAR y no m谩s de 80 caracteres, a la tabla Cliente.

3. Modificar la cantidad m谩xima de caracteres a 20 del atributo Categor铆a de la tabla Producto.

4. Eliminar el atributo Categor铆a de la tabla Producto.

5. Eliminar el atributo Precio de la tabla Orden.

6. Insertar un cliente cuyo identificador es 1, su Nombre es Edgar Frank Codd y la Provincia, Isla de Portland.

7. Cambiar la provincia a Isla Williams del cliente cuyo nombre es Edgar Frank Codd.

8. Eliminar los clientes cuyo nombre sea Edgar Frank Codd.

#### _Data Query Language_

> **Voz en off con tono grave:** ejecutemos los siguientes comandos para insertar vaaaaarios clientes, productos y 贸rdenes.

In [ ]:
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('International', 'Las Tunas', 'Calle 8355');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Electronic Bike Repair & Supplies', 'Las Tunas', 'Calle 6022');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Premier Sport, Inc.', 'Ciudad de la Habana', 'Calle 6029');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Comfort Road Bicycles', 'Granma', 'Calle 4979');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Metro Sport Equipment', 'Santiago de Cuba', 'Calle 3463');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Green Lake Bike Company', 'Matanzas', 'Calle 5205');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Mountain Works', 'Camag眉ey', 'Calle 5225');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('Continental Pro Cycles', 'Santiago de Cuba', 'Calle 1273');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ('A. Datum Corporation', 'Granma', 'Calle 9957');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Trey Research', 'Camag眉ey', 'Calle 3831');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Andersons Custom Bikes', 'Holgu铆n', 'Calle 8631');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Compete, Inc.', 'Santiago de Cuba', 'Calle 1293');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Beaumont Bikes', 'Las Tunas', 'Calle 5736');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Light Speed', 'Santiago de Cuba', 'Calle 7187');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'SUPERSALES INC.', 'Ciego de vila', 'Calle 1729');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Image Makers Bike Center', 'Ciudad de la Habana', 'Calle 5079');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Compete Enterprises, Inc', 'Matanzas', 'Calle 9895');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'G & K Bicycle Corp.', 'Camag眉ey', 'Calle 7865');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Cycling Master', 'Pinar del R铆o', 'Calle 4428');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Jeffs Sporting Goods', 'Cienfuegos', 'Calle 9616');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Business Equipment Center', 'Sancti Sp铆ritus', 'Calle 7443');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Victory Bikes', 'La Habana', 'Calle 3460');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Norstan Bike Hut', 'Granma', 'Calle 8152');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'First Rate Bicycles', 'Cienfuegos', 'Calle 5114');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Ready Rentals', 'La Habana', 'Calle 2991');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'First National Sport Co.', 'Villa Clara', 'Calle 7467');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Capital Road Cycles', 'Camag眉ey', 'Calle 5391');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Wide World Importers', 'Ciudad de la Habana', 'Calle 8902');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Integrated Sport Products', 'Holgu铆n', 'Calle 7617');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Consumer Cycles', 'Granma', 'Calle 7117');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Federal Sport', 'Camag眉ey', 'Calle 2965');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Advanced Bicycles', 'Granma', 'Calle 9067');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Signature Cycles', 'La Habana', 'Calle 8546');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Indiana Bicycle Center', 'Ciudad de la Habana', 'Calle 6796');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Mitchell Sports', 'Holgu铆n', 'Calle 2972');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Recreation Place', 'Santiago de Cuba', 'Calle 5331');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Inner City Bikes', 'Camag眉ey', 'Calle 7476');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Allenson Cycles', 'Holgu铆n', 'Calle 1908');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Hills Bicycle Service', 'Las Tunas', 'Calle 7465');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'West Junction Cycles', 'La Habana', 'Calle 9145');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Speed Corporation', 'Ciudad de la Habana', 'Calle 5290');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Legend Cycles', 'Ciego de vila', 'Calle 3929');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Inline Accessories', 'Camag眉ey', 'Calle 5215');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Competition Bike Training Systems', 'Holgu铆n', 'Calle 8282');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Chicago City Saddles', 'Holgu铆n', 'Calle 7879');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Burnett Road Warriors', 'Santiago de Cuba', 'Calle 3654');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Bike Satellite Inc.', 'Sancti Sp铆ritus', 'Calle 6969');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Gardner Touring Cycles', 'Cienfuegos', 'Calle 3580');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Magic Cycles', 'Holgu铆n', 'Calle 3002');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Vision Cycles, Inc.', 'Ciudad de la Habana', 'Calle 1616');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Bergeron Off-Roads', 'Camag眉ey', 'Calle 7236');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Hybrid Bicycle Center', 'Camag眉ey', 'Calle 9347');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Jackson Authority', 'Ciudad de la Habana', 'Calle 9357');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Pro Sport Industries', 'Pinar del R铆o', 'Calle 9100');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Sport Fan Co.', 'Camag眉ey', 'Calle 1845');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'International Bicycles', 'La Habana', 'Calle 1962');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Wood Fitness', 'Ciego de vila', 'Calle 9576');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Midwest Sport, Inc.', 'Sancti Sp铆ritus', 'Calle 2332');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Electronic Bike Co.', 'Camag眉ey', 'Calle 6128');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'International Sport Assoc.', 'Ciudad de la Habana', 'Calle 6563');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Lindell', 'Pinar del R铆o', 'Calle 4248');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Training Systems', 'Granma', 'Calle 1560');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Merit Bikes', 'Matanzas', 'Calle 7344');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Circuit Cycles', 'Santiago de Cuba', 'Calle 9898');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'International Trek Center', 'Villa Clara', 'Calle 5704');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Lakewood Bicycle', 'Matanzas', 'Calle 5558');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Knopfler Cycles', 'Sancti Sp铆ritus', 'Calle 1513');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Leaf River Terrain', 'Matanzas', 'Calle 5464');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'National Bike Association', 'Granma', 'Calle 6517');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Sport Playground', 'La Habana', 'Calle 7680');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Vista Road Bikes', 'Villa Clara', 'Calle 9399');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Varsity Sport Co.', 'La Habana', 'Calle 7296');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Crowley Sport', 'Camag眉ey', 'Calle 8474');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Australia Bike Retailer', 'Camag眉ey', 'Calle 6127');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Northern Bike Travel', 'Ciudad de la Habana', 'Calle 2660');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Cruger Bike Company', 'Ciego de vila', 'Calle 3256');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Custom Frames, Inc.', 'Santiago de Cuba', 'Calle 6117');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Aurora Bike Center', 'Pinar del R铆o', 'Calle 3372');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'GMA Ski & Bike', 'Holgu铆n', 'Calle 6112');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Bicycle Specialists', 'Camag眉ey', 'Calle 5646');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Bloomington Multisport', 'Santiago de Cuba', 'Calle 1699');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Illinois Trek & Clothing', 'Sancti Sp铆ritus', 'Calle 2401');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Litware, Inc.', 'Holgu铆n', 'Calle 6782');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Proseware, Inc.', 'Ciego de vila', 'Calle 5975');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'American Bicycles and Wheels', 'Camag眉ey', 'Calle 9949');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Carlson Specialties', 'Matanzas', 'Calle 1580');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Expert Bike Co', 'Sancti Sp铆ritus', 'Calle 5347');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Greenwood Athletic Company', 'Ciudad de la Habana', 'Calle 1645');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Sports House', 'Ciudad de la Habana', 'Calle 2357');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Reliance Fitness, Inc.', 'Villa Clara', 'Calle 5059');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'WestAmerica Bicycle Co.', 'Pinar del R铆o', 'Calle 4499');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'American Bikes', 'Holgu铆n', 'Calle 2823');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Chicago Rent-All', 'Granma', 'Calle 1266');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Superior Bicycles', 'Sancti Sp铆ritus', 'Calle 9665');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Team Athletic Co.', 'Santiago de Cuba', 'Calle 1151');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Hill Bicycle Center', 'Camag眉ey', 'Calle 3504');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Northwind Traders', 'Santiago de Cuba', 'Calle 6289');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Trikes, Inc.', 'Holgu铆n', 'Calle 3917');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Marsh', 'Villa Clara', 'Calle 9773');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Holiday Skate & Cycle', 'Granma', 'Calle 9755');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Touring Equipment Center', 'Matanzas', 'Calle 2190');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Fitness Association', 'Granma', 'Calle 2603');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Morgan Bike Accessories', 'Granma', 'Calle 5901');
%sql INSERT INTO Cliente (NombreC,Provincia,Direcci贸n) VALUES ( 'Professional Athletic Consultants', 'Holgu铆n', 'Calle 5625');

%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (1, 'Adjustable Race', 248);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (2, 'Bearing Ball', 110);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (3, 'BB Ball Bearing', 467);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (4, 'Headset Ball Bearings', 771);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (5, 'Blade', 657);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (6, 'LL Crankarm', 432);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (7, 'ML Crankarm', 354);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (8, 'HL Crankarm', 943);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (9, 'Chainring Bolts', 101);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (10, 'Chainring Nut', 642);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (11, 'Chainring', 28);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (12, 'Crown Race', 248);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (13, 'Chain Stays', 320);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (14, 'Decal 1', 989);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (15, 'Decal 2', 682);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (16, 'Down Tube', 654);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (17, 'Mountain End Caps', 282);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (18, 'Road End Caps', 615);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (19, 'Touring End Caps', 704);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (20, 'Fork End', 701);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (21, 'Freewheel', 949);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (22, 'Flat Washer 1', 93);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (23, 'Flat Washer 6', 160);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (24, 'Flat Washer 2', 381);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (25, 'Flat Washer 9', 797);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (26, 'Flat Washer 4', 169);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (27, 'Flat Washer 3', 793);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (28, 'Flat Washer 8', 307);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (29, 'Flat Washer 5', 823);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (30, 'Flat Washer 7', 886);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (31, 'Fork Crown', 556);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (32, 'Front Derailleur Cage', 716);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (33, 'Front Derailleur Linkage', 699);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (34, 'Guide Pulley', 13);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (35, 'LL Grip Tape', 991);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (36, 'ML Grip Tape', 806);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (37, 'HL Grip Tape', 858);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (38, 'Thin-Jam Hex Nut 9', 62);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (39, 'Thin-Jam Hex Nut 10', 514);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (40, 'Thin-Jam Hex Nut 1', 525);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (41, 'Thin-Jam Hex Nut 2', 272);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (42, 'Thin-Jam Hex Nut 15', 993);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (43, 'Thin-Jam Hex Nut 16', 691);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (44, 'Thin-Jam Hex Nut 5', 386);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (45, 'Thin-Jam Hex Nut 6', 434);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (46, 'Thin-Jam Hex Nut 3', 675);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (47, 'Thin-Jam Hex Nut 4', 677);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (48, 'Thin-Jam Hex Nut 13', 472);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (49, 'Thin-Jam Hex Nut 14', 244);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (50, 'Thin-Jam Hex Nut 7', 353);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (51, 'Thin-Jam Hex Nut 8', 526);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (52, 'Thin-Jam Hex Nut 12', 169);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (53, 'Thin-Jam Hex Nut 11', 346);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (54, 'Hex Nut 5', 691);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (55, 'Hex Nut 6', 395);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (56, 'Hex Nut 16', 155);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (57, 'Hex Nut 17', 949);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (58, 'Hex Nut 7', 85);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (59, 'Hex Nut 8', 973);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (60, 'Hex Nut 9', 488);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (61, 'Hex Nut 22', 638);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (62, 'Hex Nut 23', 46);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (63, 'Hex Nut 12', 120);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (64, 'Hex Nut 13', 214);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (65, 'Hex Nut 1', 86);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (66, 'Hex Nut 10', 311);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (67, 'Hex Nut 11', 548);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (68, 'Hex Nut 2', 306);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (69, 'Hex Nut 20', 997);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (70, 'Hex Nut 21', 875);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (71, 'Hex Nut 3', 796);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (72, 'Hex Nut 14', 220);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (73, 'Hex Nut 15', 100);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (74, 'Hex Nut 4', 178);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (75, 'Hex Nut 18', 428);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (76, 'Hex Nut 19', 955);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (77, 'Handlebar Tube', 402);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (78, 'Head Tube', 774);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (79, 'LL Hub', 947);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (80, 'HL Hub', 122);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (81, 'Keyed Washer', 492);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (82, 'External Lock Washer 3', 320);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (83, 'External Lock Washer 4', 62);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (84, 'External Lock Washer 9', 469);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (85, 'External Lock Washer 5', 360);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (86, 'External Lock Washer 7', 386);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (87, 'External Lock Washer 6', 370);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (88, 'External Lock Washer 1', 7);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (89, 'External Lock Washer 8', 618);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (90, 'External Lock Washer 2', 836);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (91, 'Internal Lock Washer 3', 856);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (92, 'Internal Lock Washer 4', 773);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (93, 'Internal Lock Washer 9', 88);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (94, 'Internal Lock Washer 5', 26);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (95, 'Internal Lock Washer 7', 886);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (96, 'Internal Lock Washer 6', 225);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (97, 'Internal Lock Washer 10', 872);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (98, 'Internal Lock Washer 1', 476);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (99, 'Internal Lock Washer 8', 300);

%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (83, 1, '2011-05-17 00:00:00', '4');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (32, 38, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (32, 39, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (38, 203, '2011-05-17 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (85, 4, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (92, 185, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (11, 186, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 6, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 7, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 8, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 82, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 83, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 84, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 85, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 86, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 101, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 102, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 103, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 104, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 105, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 9, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 10, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 11, '2012-01-14 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 117, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 118, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 119, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 120, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (80, 446, '2012-01-14 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 9, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 10, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 11, '2012-01-14 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (81, 177, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (46, 176, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (21, 12, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (27, 196, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (27, 197, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 171, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 172, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 173, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 174, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 175, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 413, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 414, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 415, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 416, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 417, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (93, 179, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (64, 32, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (64, 33, '2012-01-15 00:00:00', '550');

c) Implemente las siguientes consultas:

9. Obtener los clientes cuyos nombres comienzan con "International".

10. Obtener el nombre y el precio de los productos que se han vendido.

11. Obtener el nombre, la direcci贸n y la provincia de los clientes que viven en la provincia "La Habana" o "Pinar del R铆o".

12. 驴Cu谩ntos clientes hay por provincia?

> **CAMBIEMOS DE ESCENARIO...**

La Oficina del Festival Internacional del Nuevo Cine Latinoamericano es la
encargada cada a帽o de la organizaci贸n del Festival Internacional del Nuevo Cine
Latinoamericano. Para esto cuenta con un sistema automatizado que maneja
cierta informaci贸n contenida en una base de datos de la cual se muestra un
fragmento a continuaci贸n:

**Pel铆cula** (<u>IDPeli</u>, T铆tulo , Director, Pa铆s, Duraci贸n, A帽o, IDSecc) 

IDSecc **FK** Secci贸n. No admite nulos 


**Jurado** (<u>IDJur</u>, Nombre, Pa铆s, FechaDeNacimiento, IDSecc)

IDSecc **FK** Secci贸n. No admite nulos 

**Secci贸n** (<u>IDSecc</u>, Nombre, Tipo)

**Pel铆culaGanadora** (<u>IDPremiada</u>, IDPeli, NombrePremio)

IDPeli **FK** Pel铆cula. No admite nulos

In [ ]:
%%sql 

DROP DATABASE IF EXISTS FestivalDeCine34;
CREATE DATABASE FestivalDeCine34;
USE FestivalDeCine34;

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Secci贸n (
  IDSecc int(11) NOT NULL AUTO_INCREMENT,
  Nombre varchar(50) NOT NULL,
  Tipo varchar(50) NOT NULL,
  PRIMARY KEY (IDSecc),
  UNIQUE (Nombre)
);

In [ ]:
%%sql 

INSERT INTO `Secci贸n` (`IDSecc`, `Nombre`, `Tipo`) VALUES
(1, 'Panorama Latinoamericano', 'Fuera de competencia'),
(2, 'Panorama Contempor谩neo Internacional', 'Fuera de competencia'),
(3, 'peras Primas', 'En competencia'),
(4, 'Ficci贸n', 'En competencia'),
(5, 'World Cinema Fund', 'Fuera de competencia'),
(6, 'Muestra de Cine Polaco', 'Fuera de competencia'),
(7, 'Documental', 'En competencia'),
(8, 'Muestra de Cine Italiano', 'Fuera de competencia'),
(9, 'Muestra de Cine Canadiense', 'Fuera de competencia'),
(10, 'Muestra de Cine Alem谩n', 'Fuera de competencia'),
(11, 'Muestra de Cine Espa帽ol', 'Fuera de competencia');

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Jurado (
  IDSecc INT REFERENCES Secci贸n(IDSecc) ON UPDATE CASCADE,
  IDJur int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  Nombre varchar(50) NOT NULL,
  Pa铆s char(10) NOT NULL,
  FechaDeNacimiento date NOT NULL
);

In [ ]:
%%sql 

INSERT INTO `Jurado` (`IDJur`, `Nombre`, `Pa铆s`, `FechaDeNacimiento`, `IDSecc`) VALUES
(1, 'Boris Quercia', 'Chile', '1955-03-02', 4),
(2, 'Gast贸n Pauls', 'Argentina', '1965-02-05', 4),
(3, 'rsula Pruneda', 'M茅xico', '1944-12-04', 4),
(4, 'Concei莽谩o Senna', 'Brasil', '1948-11-23', 4),
(5, 'Manuel Herrera', 'Cuba', '1976-06-21', 4),
(6, 'Diego Vega', 'Per煤', '1958-03-17', 3),
(7, 'Marit茅 Ug谩s', 'Venezuela', '1966-03-27', 3),
(8, 'Esteban Insausti', 'Cuba', '1977-07-02', 3),
(9, 'Aldo Garay', 'Uruguay', '1970-05-03', 7),
(10, 'Carlos Azpur煤a', 'Venezuela', '1973-08-04', 7),
(11, 'Rolando Almirante', 'Cuba', '1973-06-05', 7);

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Pel铆cula (
  IDPeli int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  T铆tulo varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  Director varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  Pa铆s char(10) COLLATE utf8_unicode_ci NOT NULL,
  Duraci贸n smallint(5) unsigned NOT NULL,
  A帽o smallint(5) unsigned NOT NULL,
  IDSecc INT REFERENCES Secci贸n(IDSecc) ON UPDATE CASCADE
);

In [ ]:
%%sql 

INSERT INTO `Pel铆cula` (`IDPeli`, `T铆tulo`, `Director`, `Pa铆s`, `Duraci贸n`, `A帽o`, `IDSecc`) VALUES
(1, 'Un feliz acontecimiento', 'R茅mi Bezan莽on', 'Francia', 107, 2011, 2),
(2, 'Drom贸manos', 'In茅s de Oliveira C茅zar', 'Argentina', 90, 2012, 4),
(3, 'Polvo', 'Julio Hern谩ndez Cord贸n', 'Guatemala', 80, 2012, 5),
(4, 'Rosa', 'Wodjciechs Marzowski', 'Polonia', 94, 2012, 6),
(5, 'La demora', 'Rodr铆go Pl谩', 'Uruguay', 84, 2012, 4),
(6, 'Los salvajes', 'Alejandro Fadel', 'Argentina', 119, 2012, 3),
(7, 'El hombre que vendr谩', 'Giorgio Diritti', 'Italia', 117, 2009, 8),
(8, 'La suerte en tus manos', 'Daniel Burman', 'Argentina', 107, 2011, 1),
(9, 'Elefante blanco', 'Pablo Trapero', 'Argentina', 110, 2012, 4),
(10, 'La lucha de Ana', 'Bladimir Abud', 'Rep煤blica', 90, 2011, 1),
(11, 'Pescador', 'Sebasti谩n Cordero', 'Ecuador', 96, 2011, 4),
(12, 'Mi universo en min煤sculas', 'Hatuey Viveros', 'M茅xico', 90, 2011, 3),
(13, 'Hoy', 'Tata Amaral', 'Brasil', 82, 2011, 4),
(14, 'La pel铆cula de Ana', 'Daniel D铆az Torres', 'Cuba', 100, 2012, 4),
(15, 'Cornelia frente al espejo', 'Daniel Rosenfeld', 'Argentina', 103, 2012, 3),
(16, 'Melaza', 'Carlos Lechuga', 'Cuba', 80, 2012, 3),
(17, 'Villegas', 'Gonzalo Tobal', 'Argentina', 98, 2012, 3),
(18, 'Las cosas como son', 'Fernando Lavanderos Montero', 'Chile', 105, 2012, 4),
(19, 'Choc贸', 'Jhonny Hendrix Hinestroza', 'Colombia', 80, 2011, 3),
(20, 'El 煤ltimo tren a casa', 'Lixin Fan', 'Canad谩', 85, 2009, 9),
(21, 'B谩rbara', 'Christian Petzold', 'Alemania', 105, 2012, 10),
(22, 'El p谩ramo', 'Jaime Osorio M谩rquez', 'Colombia', 107, 2011, 1),
(23, 'No', 'Pablo Larra铆n', 'Chile', 115, 2012, 4),
(24, 'De martes a martes', 'Gustavo Fern谩ndez Trivi帽o', 'Argentina', 94, 2011, 3),
(25, 'El gran sue帽o de Konrad Koch', 'Sebastian Groebler', 'Alemania', 113, 2010, 10),
(26, 'Violeta se fue a los cielos', 'Andr茅s Wood', 'Chile', 110, 2011, 4),
(27, 'Viento de Oeste', 'Robert Thalheim', 'Alemania', 89, 2011, 10),
(28, 'Par贸n en el camino', 'Andreas Dresen', 'Alemania', 110, 2011, 10),
(29, 'Evelyn', 'Isabel de Ocampo', 'Espa帽a', 96, 2011, 11),
(30, 'Era uma vez eu, Ver贸nica', 'Marcelo G贸mes', 'Brasil', 91, 2011, 4),
(31, 'Penumbras', 'Charlie Medina', 'Cuba', 79, 2012, 3),
(32, 'Los equilibristas', 'Ivano de Matteo', 'Italia', 100, 2012, 8),
(33, 'Un hogar de fin de semana', 'Hans-Christian Schmid', 'Alemania', 85, 2012, 10),
(34, 'Jaque mate', 'Jos茅 Mar铆a Cabral', 'Rep煤blica', 80, 2011, 1),
(35, 'Fausto', 'Alexander Sokurov', 'Rusia', 134, 2011, 2),
(36, 'Monsieur Lazhar', 'Philippe Falardeau', 'Canad谩', 94, 2011, 9),
(37, 'Starbuck', 'Ken Scott', 'Canad谩', 109, 2011, 9);

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Pel铆culaGanadora (
  IDPremiada int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  IDPeli INT REFERENCES Pel铆cula(IDPeli) ON UPDATE CASCADE,
  NombrePremio varchar(100) COLLATE utf8_unicode_ci NOT NULL
);

In [ ]:
%%sql 

INSERT INTO `Pel铆culaGanadora` (`IDPremiada`, `IDPeli`, `NombrePremio`) VALUES
(1, 16, '6to Premio de la Popularidad'),
(2, 16, 'Premio El M茅gano'),
(3, 9, 'Premio Coral de Edici贸n'),
(4, 9, 'Menci贸n SIGNIS'),
(5, 9, '5to Premio de la Popularidad'),
(6, 9, 'Premio Caminos'),
(7, 14, 'Premio Coral de Actuaci贸n Femenina'),
(8, 14, 'Premio Coral de Gui贸n'),
(9, 14, 'Premio de Distribuci贸n de Amazonia Films'),
(10, 14, '2do Premio de la Popularidad'),
(11, 14, 'Premio Otorgado por el C铆rculo de Periodistas de Cultura de la UPEC'),
(12, 5, 'Premio Coral de M煤sica Original'),
(13, 5, 'Premio nete'),
(14, 11, 'Premio Coral de Actuaci贸n Masculina'),
(15, 30, 'Menci贸n del Jurado'),
(16, 23, '1er Premio Coral'),
(17, 23, 'Premio SIGNIS'),
(18, 23, '3er Premio de la Popularidad'),
(19, 23, 'Premio de la Asociaci贸n Cubana de la Prensa Cinematogr谩fica'),
(20, 19, 'Premio Roque Dalton'),
(21, 6, '2do Premio Coral'),
(22, 6, 'Premio Coral a la Mejor Contribuci贸n Art铆stica (Mejor Direcci贸n)'),
(23, 26, '2do Premio Coral'),
(24, 26, 'Premio Coral de Direcci贸n Art铆stica'),
(25, 26, 'Premio de la Asociaci贸n de Cine, Radio y Televisi贸n de la UNEAC'),
(26, 26, 'Premio Glauber Rocha');

> **Voz en off con tono grave:**  Contando con esta info se puede entonces dar respuesta a los siguientes incisos utilizando el

I) Obtenga la cantidad de pel铆culas registradas por cada director.

II) Recupere ordenados alfab茅ticamente los nombres de aquellas secciones en las que se presentaron pel铆culas cubanas o argentinas cuya duraci贸n era de 90 minutos o m谩s.

III) Obtener el tiempo m谩ximo de pel铆cula registrado por cada secci贸n .

IV) Obtener el nombre de las secciones que cuentan con jueces con menos de 20 a帽os

ups, y con m谩s de 20!?

V) Las secciones s贸lo pueden ser del tipo "En competencia" o "Fuera de competencia". Muestre la cantidad y el promedio de duraci贸n de las pel铆culas presentadas en cada uno de estos tipos de secci贸n.

VI) Obtener el t铆tulo, director y la cantidad de premios recibidos por las 5 pel铆culas m谩s laureadas.

VII) Obtenga el nombre de los miembros del jurado que participaron en secciones en las que se premiaron al menos a cinco pel铆culas distintas. Los jurados deben aparecer ordenados seg煤n su edad, comenzando por el mayor.

VIII) Muestre los jueces que se han asignado a secciones en las que participan pel铆culas de su mismo pa铆s. Agregue tambi茅n su pa铆s y la secci贸n involucrada.

IX) Obtener el nombre y la cantidad total de pel铆culas asociadas a las secciones en las que se hayan registrado al menos 1 pel铆cula ganadora.

X) Presente el t铆tulo y el director de las pel铆culas que fueron galardonadas y poseen una duraci贸n mayor que el promedio.